Repository: Hassan-AbuGareeb/Survey-Configurator
Catalog: Survey Configurator/SharedResources/GlobalStrings.*.resx
Languages: ar

# AddOperation
source: Add
ar: إضافة

source: Add Question
ar: إضافة سؤال

# CancelOperation
source: Any changes made won't be saved
ar: لن يتم الإحتفاظ بأية تعديلات تم القيام بها

# CancelOperationTitle
source: Cancel Operation
ar: إلغاء العملية

# DataBaseConnectionError
source: An error occured while connecting to database, the application may not work properly. would like to continue?
ar: حدث خطأ أثناء الاتصال بقاعدة البيانات, قد لا يعمل البرنامج بشكل صحيح هل ترغب بالاستمرار؟

# DataBaseConnectionErrortitle
source: Database connection error
ar: خطأ في الاتصال بقاعدة البيانات

# DatabaseNotConnectedError
source: Lost connection to database, refer to your system admin
ar: فُقد الاتصال بقاعدة البيانات, اطلب المساعدة من مشرف النظام

# DatabaseNotConnectedErrorTitle
source: Database not connected
ar: قاعدة البيانات غير متصلة

# DataFetchingError
source: An error occured while loading data please try again. if you keep getting this error restart the app
ar: حدث خطأ اثناء تحميل البيانات, قم بإعادة تشغيل البرنامج اذا تكرر حدوث هذا الخطأ

# DataFetchingErrorTitle
source: Data Loading Error
ar: خطأ في تحميل البيانات

# DeleteOperationTitle
source: Delete question
ar: حذف سؤال

# DeleteQuestionConfirm
source: Are you sure you want to delete the selected questions?
ar: هل أنت متأكد من تنفيذ عملية الحذف؟

# EditOperation
source: Edit
ar: تعديل

source: Edit Question
ar: تعديل سؤال

source: error
ar: خطأ

# InvalidInputTitle
source: Invalid input
ar: بينانات خاطئة

# MissingFields
source: The following fields must have proper values:
ar: الحقول التالية مطلوبة:

source: Operation Error
ar: فشلت العملية

# OperationErrorTitle
source: Operation Failed, please try again
ar: فشلت العملية, قم بإعادة المحاولة مرة اخرى

# OperationSuccessful
source: Operation completed successfully!
ar: !تمت العملية بنجاح

# OperationSuccessfulTitle
source: Operation successful
ar: نجحت العملية

source: Question text
ar: نص السؤال

source: Question type
ar: نوع السؤال

# RequiredFields
source: Missing fields
ar: حقول مطلوبة

# SliderInvalidInput
source: Start value cannot be greater than end value
ar: لا يمكن للقيمة العظمى ان تكون اصغر من القيمة الصغرى

# SqlError
source: Database related error, refer to your system admin
ar: خطأ متعلق بقاعدة البيانات, اطلب المساعدة من مشرف النظام

# SqlErrorTitle
source: Database error
ar: خطأ في قاعدة البيانات

source: Unauthorized access error
ar: خطأ في الصلاحيات

# UnAuthorizedAccessErrorTitle
source: You have restrictions on file operations please refer to your system admin
ar: خطأ في صلاحيات الوصول للملفات, اطلب المساعدة من مشرف النظام

# UnknownError
source: An Unknown error occured
ar: حدث خطأ غير معروف

# UnknownErrorTitle
source: Unknown error
ar: خطأ غير معروف
